{
  "posts": [
    {
      "id": 1,
      "slug": "nextjs-sikhne-ka-tarika",
      "title": "Next.js Sikhne Ka Asaan Tarika",
      "excerpt": "Learning Next.js involves understanding its core features and how it extends React for building production-ready web applications.",
      "content": "Next.js ko seekhna shuru karne ke liye sabse pehle tumhe React ki basic understanding honi chahiye. React ek library hai jo user interface banane ke liye use hoti hai, lekin production-ready applications banane ke liye tumhe aur bhi features ki zaroorat padti hai, jaise routing, server-side rendering, aur optimization. Ye sab Next.js ke andar built-in milta hai.\n\n### Prerequisites:\n- **JavaScript Knowledge**: ES6+ features jaise arrow functions, async/await, modules.\n- **React Basics**: Components, props, state, hooks aur lifecycle methods.\n\n### Next.js ke Core Features:\n1. **File-based Routing**: Tumhe manually routes define karne ki zaroorat nahi hai. Sirf `pages` folder me file create karo aur wo automatic route ban jaati hai.\n2. **SSR aur SSG**: Server Side Rendering aur Static Site Generation dono supported hai.\n3. **API Routes**: Backend APIs directly bana sakte ho bina alag server setup kiye.\n4. **Image Optimization**: Built-in `<Image>` component tumhare images ko optimize karta hai.\n\n### Learning Approach:\nSabse pehle ek chota project banao, jaise ek blog ya todo app. Fir dheere-dheere features add karo jaise authentication, SSR pages aur API integration. Documentation aur examples dekhte raho.\n\n### Example:\nAgar tumhe ek blog banana hai, toh tum `/pages/index.js` me homepage aur `/pages/[slug].js` me dynamic routing laga sakte ho.\n\nAise step by step seekhne par tumhe Next.js ka flow aur ecosystem dono samajh aayega. Ek do real project banake tum ekdum confident ho jaoge.",
      "author": "Rahul Sharma",
      "date": "2024-01-15",
      "image": "/images/nextjs-tutorial.jpg"
    },
    {
      "id": 2,
      "slug": "react-vs-nextjs",
      "title": "React aur Next.js Mein Antar",
      "excerpt": "React ek library hai jabki Next.js ek framework hai. Aaiye detail mein samjhte hain.",
      "content": "React aur Next.js dono web development ke popular tools hain lekin dono alag-alag purpose serve karte hain. React ek library hai jo tumhe UI banane ki freedom deti hai, lekin uske sath tumhe routing, state management aur optimization ke liye alag-alag tools use karne padte hain.\n\n### React:\n- React ek **UI Library** hai.\n- Isme tumhe routing ke liye `react-router-dom` aur server-side rendering ke liye alag solutions chahiye.\n- Bohot zyada flexibility milti hai par tumhe khud ka ecosystem build karna padta hai.\n\n### Next.js:\n- Ye ek **Framework** hai jo React ke upar bana hai.\n- Isme SSR, SSG, routing, API routes sab built-in hai.\n- Deployment easy hai, specially Vercel par.\n\n### Kab React Choose Karein?\nAgar tumhe sirf ek choti SPA banani hai jisme SEO ka zyada concern nahi hai, toh React best hai.\n\n### Kab Next.js Choose Karein?\nAgar tumhe SEO-friendly website, blog, e-commerce ya koi large-scale project banana hai, toh Next.js best option hai.\n\nIn short, React tumhe flexibility deta hai aur Next.js tumhe production-level speed aur features deta hai. Dono ka use-case alag hai, aur developer ke liye dono seekhna important hai.",
      "author": "Priya Singh",
      "date": "2024-01-10",
      "image": "/images/react-vs-nextjs.jpg"
    },
    {
      "id": 3,
      "slug": "dynamic-routing",
      "title": "Dynamic Routing Kaise Karein",
      "excerpt": "Next.js mein dynamic routing ek bahut powerful feature hai. Aaiye seekhte hain.",
      "content": "Dynamic routing Next.js ka ek powerful feature hai jisse tum apne app ke liye dynamic URLs generate kar sakte ho. Matlab agar tumhe ek blog banana hai aur har blog post ka slug alag hoga, toh tumhe manually route define karne ki zaroorat nahi.\n\n### How it Works:\nNext.js me agar tum `/pages/[slug].js` file banate ho, toh ye automatically ek dynamic route ban jata hai. Yaha `[slug]` ek placeholder hai jisme different values aa sakti hain.\n\n### Example:\n- `/pages/[id].js`\n- Agar tum `/posts/1` open karoge toh `[id] = 1`\n- Agar `/posts/hello-world` open karoge toh `[id] = hello-world`\n\n### getStaticPaths aur getStaticProps:\nStatic Site Generation ke liye tumhe `getStaticPaths` aur `getStaticProps` ka use karna padta hai. Isse tum multiple dynamic pages ek sath generate kar sakte ho.\n\n### Benefits of Dynamic Routing:\n1. **Scalability**: Easily thousands of pages generate ho jate hain.\n2. **SEO Friendly**: Har page ka unique URL hota hai jo search engine ke liye best hai.\n3. **User Friendly**: URLs clean aur meaningful hote hain.\n\nDynamic routing ek must-have feature hai jo har real-world project me kaam aata hai, chahe wo blog ho, e-commerce site ho ya social media platform.",
      "author": "Amit Kumar",
      "date": "2024-01-05",
      "image": "/images/dynamic-routing.jpg"
    }
  ]
}
